[
  {
    "id" : "carol-danvers",
    "name" : "Carol Danvers",
    "alias": "Captain Marvel",
    "headline" : "Carol Danvers is a Human/Kree hybrid and a military warrior,   being popularly known as the high-flying super-hero Captain Marvel.",
    "description" : "Former Air Force pilot and intelligence agent Carol Danvers pursued her dream of space exploration as a NASA employee, but her life forever changed when she was accidentally transformed into a human-Kree hybrid with extraordinary powers. Now, Carol is the latest warrior to embrace the mantle of Captain Marvel, and she has taken her place as one of the world’s mightiest heroes. As a NASA security officer, Carol investigated numerous attempts made by the Kree and Skrulls to infiltrate Kennedy Space Center and disrupt America’s space program. During a battle between the heroic Mar-Vell and his rival, Yon-Rogg, Carol was exposed to the Psyche-Magnitron, a Kree device that could make imagination into reality. Carol subconsciously envied Mar-Vell’s powers, and the machine responded to those desires by rewriting her DNA to make her a human/Kree hybrid with abilities similar to his. Carol took on the identity of Ms. Marvel and even fought alongside Mar-Vell/Captain Marvel and the Avengers. Her early career was cut short when Rogue, a member of the Brotherhood of Evil Mutants, attacked Carol and permanently drained her powers and memories. It took years for Carol to recover from her ordeal, but she finally achieved her dream of space exploration and traveled far from Earth. Carol even became cosmically empowered and took on the codename Binary. The Binary powers faded over time, leaving Carol with most of her original abilities. Carol returned to Earth and rejoined the Avengers. Years later, Carol adopted the codename Captain Marvel as a tribute to her fallen friend and mentor. Her prominence has also grown exponentially, and Captain Marvel is now the most popular heroine in the world.",
    "link" : "https://www.marvel.com/characters/captain-marvel-carol-danvers",
    "image" : "carol-danvers",
    "gallery" : [
      "carol-danvers-1",
      "carol-danvers-2",
      "carol-danvers-3",
      "carol-danvers-4"
    ]
  },
  {
    "id" : "wanda",
    "name" : "Wanda Maximoff",
    "alias": "Scarlet Witch",
    "headline" : "Wanda Maximoff, also known as the Scarlet Witch, is a Romani Transian sorceress and twin sister of the speedster Quicksilver. Once believed to have been mutant children of Magneto, the twins are in truth orphans enhanced by the High Evolutionary at Mount Wundagore.",
    "description" : "Although much of the Scarlet Witch’s true origins remain elusive to her thanks to manipulations by others, she can still recall her early days as a child with her twin brother Pietro. The two lived on Wundagore Mountain in Eastern Europe, believing themselves born as mutants to a Romani couple named the Maximoffs. Given the name Wanda, she lived for a short time in childish innocence until local troubles involving her parents separated her and her brother from them and forced her to hide her growing powers. Nearing adulthood, Wanda and Pietro fell under the wing of the criminal Magneto and as the Scarlet Witch and Quicksilver they joined his Brotherhood of Evil Mutants. Following violent clashes between the group and the heroic X-Men, the siblings struck out on their own, unhappy with their alliance with Magneto and unsure of their future. When the founding members of the Avengers disbanded, leaving Captain America to continue the team, Wanda and Pietro accepted an invitation of membership, hoping the Avengers might help them reverse their reputations as villains.",
    "link" : "https://www.marvel.com/characters/scarlet-witch-wanda-maximoff",
    "image" : "wanda",
    "gallery" : [
      "wanda-1",
      "wanda-2",
      "wanda-3",
      "wanda-4"
    ]
  },
  {
    "id" : "harley-quinn",
    "name" : "Harleen Quinzel",
    "alias": "Harley Quinn",
    "headline" : "Dr. Harleen Frances Quinzel, also known as Harley Quinn, first appeared in the Batman: The Animated Series episode 'Joker's Favor', where she served as a humorous female sidekick to the Joker.",
    "description" : "Dr. Harleen Quinzel was a psychiatric intern at Arkham Asylum. A model student, in addition to receiving high grades in college, she was also a dedicated gymnast, winning a scholarship to Gotham City University. While researching the lunatics at Arkham, she became fascinated with one particular inmate. Ambitiously volunteering to analyze him, she pleaded with the doctors at Arkham for three months before she could treat him. After he gained her sympathy during their sessions, he seduced her, causing her to fall madly in love with him. After helping him escape from the asylum more than once, Harleen was suspected by the authorities, who revoked her license and placed her in her own cell. During an earthquake in Gotham City, she fled and became Harley Quinn, the sidekick of the Clown Prince of Crime himself. Quinn's relationship with the Joker is one of the most complex and twisted love affairs in comics: as with all people, the Joker is abusive and manipulative towards Harley, but, just as often, there's evidence of camaraderie, playfulness, and genuine affection towards her. The Joker would only use Harley for intense sexual intercourse and her body. She's the only person who's managed to become intimate on such a long term basis with the Joker, who, in turn, displays occasional moments of confusion and discomfort which results in attempts to kill her. ",
    "link" : "https://www.dccomics.com/characters/harley-quinn",
    "image" : "harley-quinn",
    "gallery" : [
      "harley-quinn-1",
      "harley-quinn-2",
      "harley-quinn-3",
      "harley-quinn-4"
    ]
  },
  {
    "id" : "poison-ivy",
    "name" : "Pamela Isley",
    "alias": "Posion Ivy",
    "headline" : "Poison Ivy is an one of the world's most prominent eco-terrorists. She is obsessed with plants, botany, and environmentalism. She uses toxins from plants and her own bloodstream for her criminal activities, which are usually aimed at protecting the natural environment.",
    "description" : "Pamela Isley grows up wealthy with emotionally distant parents. She later studies advanced botanical biochemistry at a university with Alec Holland under Dr. Jason Woodrue. Isley, a timid, shrinking violet, is easily seduced by her professor. Woodrue injects Isley with poisons and toxins as an experiment, causing her transformation. She nearly dies twice as a result from these poisonings, driving her insane. Later Woodrue flees from the authorities, leaving Pamela in the hospital for six months. Enraged at the betrayal, Pamela suffers from violent mood swings, being sweet one moment and like poison the next. When her boyfriend has a car accident after mysteriously suffering from a massive fungal overgrowth, Isley drops out of school and leaves Seattle, eventually settling in Gotham City. Taking the costumed persona of Poison Ivy, she begins a criminal career and sets out to show her power over men. Her first scheme involved threatening to release her suffocating spores into the air unless the city meets her demands. The Batman, who appears in Gotham that very same year, thwarts her scheme, and she is incarcerated in Arkham Asylum for the Criminally Insane. From this point on, she has a kind of obsession with Batman, he being the only person she could not control. Over the years, she develops plant-like superpowers, the most noticeable being a lethal toxin in her lips; she is able to literally kill with a kiss. Poison Ivy escaped from Arkham Asylum again and again, more often seducing her guards in order to make her getaway. She soon became a frequent member of Batman's Rogues Gallery, often committing robberies to fund her cause for preservation of all plant life. Poison Ivy soon came into conflict with many other heroes in her insane quest, such as Superman and Wonder Woman. She fought the Justice League at least once and joined the Injustice Gang to help oppose them.",
    "link" : "https://www.dccomics.com/characters/poison-ivy",
    "image" : "poison-ivy",
    "gallery" : [
      "poison-ivy-1",
      "poison-ivy-2",
      "poison-ivy-3",
      "poison-ivy-4"
    ]
  },
  {
    "id" : "catwoman",
    "name" : "Selina Kyle",
    "alias": "Catwoman",
    "headline" : "Selina Kyle is Catwoman, a Gotham City expert thief who crossed paths with Batman on many occasions. Having largely left behind her villainous ways.",
    "description" : "Selina and her brother Aiden were separated into different foster homes after their father was imprisoned. She ended up in Oliver's Group Home, where Miss Oliver taught the children in her care to steal for her. After getting caught stealing, years later, she was hired at the Mayor's Office, and used her clearance to look at her own file in the hopes of finding her brother. Instead, she discovered that her identity was not what she thought it was, and when she pursued it, someone shoved her off a roof to keep her from the truth. She survived, realizing that she must have been someone important enough to want dead. Months later, after deciding to become Catwoman, she learned that the files she'd seen were wiped in the interim.",
    "link" : "https://dc.fandom.com/wiki/Catwoman_(Selina_Kyle)",
    "image" : "catwoman",
    "gallery" : [
      "catwoman-1",
      "catwoman-2",
      "catwoman-3",
      "catwoman-4"
    ]
  },
  {
    "id" : "wonder-woman",
    "name" : "Diana Prince",
    "alias": "Wonder Woman",
    "headline" : "Wonder Woman is the princess Diana, the daughter of Hippolyta, Queen of the Amazons and Zeus, the mightiest of the Gods of Olympus.",
    "description" : "Princess Diana of Themyscira fights for peace in Man's World. One of the most beloved and iconic DC Super Heroes of all time, Wonder Woman has stood for nearly eighty years as a symbol of truth, justice and equality to people everywhere. Raised on the hidden island of Themyscira, also known as Paradise Island, Diana is an Amazon, like the figures of Greek legend, and her people's gift to humanity. As Themyscira's emissary to Man's World, Diana has made it her duty to lead by example, even if the differences between her birthplace and new home sometimes present hurdles for her to jump. She has come to represent the possibility and potential of life without war, hate or violence, and she is a beacon of hope to all who find themselves in need. She stands as an equal among the most powerful Super Heroes, with a sense of purpose to protect the world from injustice in all forms. Diana's job, however, is anything but easy. Constantly torn between her mission to promote peace and her need to fight back against the pervasive violence of her new home, Diana struggles to walk a line between her warrior strength and endless compassion each and every day.",
    "link" : "https://www.dccomics.com/characters/wonder-woman",
    "image" : "wonder-woman",
    "gallery" : [
      "wonder-woman-1",
      "wonder-woman-2",
      "wonder-woman-3",
      "wonder-woman-4"
    ]
  },
  {
    "id" : "black-widow",
    "name" : "Natasha Romanoff",
    "alias": "Black Widow",
    "headline" : "Natalia Alianovna also known as Black Widow, was one of the most talented spies and assassins in the entire world and a founding member of the Avengers.",
    "description" : "Black Widow was a former Russian KGB agent. She was trained by the Red Room as part of the Black Widow Ops Program to be the ultimate 'Super-Spy'. She defected to the United States of America from the Soviet Union to join S.H.I.E.L.D. Later Black Widow would then become a member of the Avengers and has been on the team on multiple occasions. She is a woman with a mysterious past which few know about. he exact year and location for the birth of Natasha Romanova is unknown, as is who her parents were. It has been rumored that Natasha was somehow related to the last ruling czars of Russia, but this rumor was never proven. There are varying accounts of Romanova's early life. One account states that in 1928, there was a fire in Stalingrad which burned down the building that infant Natasha and her mother were living in. According to the account, just before dying in the fire, Natasha's mother threw her out the window to a Russian soldier below. The soldier's name was Ivan Petrovitch, and that he watched over Natasha for her entire life, remaining by her side as her 'foster father'. Another account dates the fire to autumn 1942, during the Battle of Stalingrad. While Natasha was under Ivan's protection, Baron von Strucker abducted Natasha and presented her to the organization of assassins called the Hand in Madripoor. Natasha had in fact been working under orders from an mysterious source and her 'abduction' was to lead her into pretending to become a Master Assassin for the Hand when in reality she was to assassinate their Jonin. Logan learned of this and killed the Jonin instead while also freeing Captain America under the guise of rescuing Natasha. According to this account, Natasha then grew and matured, proving herself to be an amazing athlete and scholar, while gaining distinction in the USSR as a ballerina.",
    "link" : "https://www.marvel.com/characters/black-widow-natasha-romanoff",
    "image" : "black-widow",
    "gallery" : [
      "black-widow-1",
      "black-widow-2",
      "black-widow-3",
      "black-widow-4"
    ]
  },
  {
    "id" : "supergirl",
    "name" : "Kara Zor-El",
    "headline" : "Kara-Zor-El is the heroine known as Supergirl. Born on Krypton to Superman's uncle and aunt, Kara was rocketed to Earth by her father to save her life.",
    "description" : "Kara was born on Argo City to Zor-El and Alura In-Ze. When she was fifteen, her cousin Kal-El was born. Around that time, her father distanced himself from her uncle Jor-El after Jor-El expressed his disapproval at his brother's biological experiments. Not caring for their feud, Kara kept on babysitting her baby cousin while studying for her graduation trials. A few months later, Kara accompanied her father to his lab. There, Zor-El showed her a space pod where he put her to sleep. As Kara lost consciousness, Zor-El stated Jor-El was right about Krypton being doomed, and he had built a rocket to save her. Ignoring her protestations, Zor-El placed Kara in her vessel together with a Sunstone recording his last words, and launched her into space right before Krypton's explosion. Kara's rocket reached the Solar System, and per its programming, it spent two decades orbiting the Earth's sun as its passenger remained in stasis. After a while, Kara's pod crash-landed in Siberia. Kara stumbled from her craft only to be suddenly surrounded by gigantic armed robots who began trying to subdue her. Kara instinctively fought back, displaying powers she didn't know she had when Superman showed up all of sudden. Confused about her current situation, her strange powers, and the arrival of a stranger wearing her family's crest, Kara demanded to know who he was. When Superman identified himself as her cousin Kal-El, Kara became enraged, thinking he was an impostor, and she attacked Superman. The two exchanged blows all the way from Siberia to the Great Wall of China, where Kara realized her fight was endangering the people nearby. She stopped fighting and agreed to listen to Superman. Nonetheless, Kara refused to believe him when he told Krypton had been gone for decades. Kara flew back to Siberia, hoping her pod held some clues, but she found instead a holographic message from a man called Symon Tycho inviting her to his space station. Kara flew to the space station only to find out it was a trap designed to test her abilities. Kara destroyed Tycho's weapons and found her pod, but she was weakened by chunks of Green Kryptonite stuck to the hull.",
    "link" : "hhttps://www.dccomics.com/characters/supergirl",
    "image" : "supergirl",
    "gallery" : [
      "supergirl-1",
      "supergirl-2",
      "supergirl-3",
      "supergirl-4"
    ]
  },
  {
    "id" : "jean-grey",
    "name" : "Jean Grey",
    "alias": "Jean Grey",
    "headline" : "Jean Grey is a mutant with vast empathic and telepathic abilities that were traumatically awakened when as a child she witnessed her best friend's death.",
    "description" : "Jean Grey is a mutant with vast empathic and telepathic abilities that were traumatically awakened when as a child she witnessed her best friend's death. For years, Jean Grey was mentored by mutant specialist Professor Charles Xavier, a telepath himself. Eventually, she also developed telekinetic powers. When Xavier opened a school for mutants in order to prepare his students to carry on his dream of peaceful coexistence between mutants and humans, Jean Grey was enrolled as the last student of his first class. As Marvel Girl, she became one of the original X-Men, a group that fight for a world that hates and fears mutants. Jean Grey is intimately associated with the Phoenix, an immensely powerful cosmic entity. After being corrupted by the Hellfire Club, Phoenix rose as the Dark Phoenix and caused immeasurable destruction. Jean Grey's conscience led the Phoenix to sacrifice herself to prevent further destruction. Jean Grey's connection to the Phoenix, a force of destruction and rebirth, inflicted a number of deaths and resurrections. Upon her most recent return, Jean Grey permanently rejected the Phoenix and took the direction of a new X-Men team. When all of mutantkind was united on the mutant-exclusive island nation of Krakoa by Charles Xavier's initiative, Jean Grey joined her former friends. On Krakoa, she was part of the governing body known as the Quiet Council as well as part of recreating X-Force, the Krakoan black ops organization, in its intelligence sector. More recently, alongside her husband, Cyclops, she decided to reform the X-Men as a Krakoan super-hero team who fights to protect mutantkind.",
    "link" : "https://www.marvel.com/characters/phoenix-jean-grey",
    "image" : "jean-grey",
    "gallery" : [
      "jean-grey-1",
      "jean-grey-2",
      "jean-grey-3",
      "jean-grey-4"
    ]
  },
  {
    "id" : "storm",
    "name" : "Ororo Munroe",
    "alias": "Storm",
    "headline" : "Ororo Munroe is a powerful mutant with weather-manipulating abilities, being also known as the windriding influential super-hero Storm.",
    "description" : "Ororo Munroe is a powerful mutant with weather-manipulating abilities, being also known as the windriding influential super-hero Storm.[25] As the daughter of a Kenyan tribal princess and of an American photojournalist who lived in Cairo, Egypt, she became an orphan after a plane crashed on and destroyed her home. The young Ororo became a sneak-thief on the streets of Cairo under the tutelage of Achmed El Gibár, who provided her a home. As a teenager, she felt an urge to travel to the south, arriving to the Serengeti plains. Venerated by the locals as a goddess, Ororo used her abilities to ease the droughts in the arid desert. She was eventually approached by Professor Xavier to join his X-Men, a mutant group aimed at implementing peace between humans and mutants. Adopting the name Storm, Ororo accepted the offer, intending to comprehend the origin and the potential of her powers. With the X-Men, Storm has had the opportunity to explore the universe in unexpected ways, also rising to prominence in the group and becoming the leader of the team for years. However, her tough experiences have led her to connect to violent aspects of her soul she had never believed to possess. After losing her powers, Storm embarked on a self-discovery journey to reconnect to the source of her abilities. Later, Storm formed her own division of X-Men apart from Xavier, that was officially sanctioned by the U.N. as a mutant police force. Storm also has strong ties with the nation of Wakanda, being its former queen due to her marriage to Black Panther.",
    "link" : "https://www.marvel.com/characters/storm",
    "image" : "storm",
    "gallery" : [
      "storm-1",
      "storm-2",
      "storm-3",
      "storm-4"
    ]
  },
  {
    "id" : "she-hulk",
    "name" : "Jennifer Walters",
    "alias": "She-Hulk",
    "headline" : "Jennifer Walters is a talented lawyer and the cousin of Bruce Banner, the Hulk. After being shot by a mobster and seriously injured, she was saved by a blood transfusion from Bruce, and his gamma-irradiated blood mutated Jennifer into the She-Hulk, kicking off her adventuring career.",
    "description" : "Jennifer Sue Walters was born in Los Angeles, California to Sheriff Morris Walters and Elaine Banner Walters. Also the cousin of Bruce Banner, Jen would spend hours in the public library reading books with him and sometimes even hiding at closing time to spend the night there, in order to help Bruce escape from his father's abuse. When she was younger, Jen wanted to become a dancer, something which her father didn't approve of. One day, while her mother was driving with some friends to see one of her recitals, she was hit by a car and killed, an event that further distanced Jen from her father. Turning her attention to school, Jen was accepted at Harvard University and also attended UCLA, where she got her law degree summa com laude. While working as a lawyer in Los Angeles, Jen was visited by her cousin Bruce, who she hadn't seen in years. He revealed to her that he had become the Hulk, and Jen invited him home so they could talk about it. On the way there, agents of Nicholas Trask, the crime boss who had killed Jen's mother years before, shot and seriously wounded her. She had been defending a gangster who had been double-crossed by Trask, and she had spread the rumor that she had evidence to incriminate Trask, which led to his retaliation. Bruce fended off the attackers and then broke into a doctor's office to treat her. Realizing Jennifer was going to die, Bruce gave her a transfusion of his own blood as there were no other supplies available. Jen died, but, thanks to the transfusion, she was thrown into the Below-Place, where she was able to enter the metaphysical Green Door and come back to life.",
    "link" : "https://www.marvel.com/characters/she-hulk-jennifer-walters",
    "image" : "she-hulk",
    "gallery" : [
      "she-hulk-1",
      "she-hulk-2",
      "she-hulk-3",
      "she-hulk-4"
    ]
  },
  {
    "id" : "batwoman",
    "name" : "Kate Kane",
    "headline" : "Kate Kane is Batwoman, one of many vigilantes who protect Gotham City using the imagery of a Bat. She is both Jewish and an out lesbian, playing a socialite during the day, and working as a vigilante by night.",
    "description" : "Kate Kane and her twin sister Beth were born to prominent colonel Jake Kane and his wife Gabrielle, herself a captain. Both parents were on active military duty, and worked extensively with intelligence organizations. As her parents were promoted, they moved to and from a wide variety of towns and bases, though Jake was often away from home. Eventually, the Kanes moved from Fort Bragg, North Carolina to Brussels, Belgium, where they worked with NATO. However, when Gabi decided to take the girls out for their twelfth birthday, they were attacked and kidnapped by terrorists. Though military intelligence managed to locate the hostages, Jacob only managed to rescue Kate, as both Gabi and Beth had been killed. He tried to prevent her from seeing the worst of it, but Kate was traumatized by the sight of her mother and sister's corpses. Jacob was a supportive father, and Kate managed to deal with her grief by emulating his cool-headedness. She excelled both academically and athletically, and was eventually accepted into West Point as a cadet. She continued to excel at the Academy, earning the rank of Brigade Executive Officer her senior year, as well as completing both Air Assault School and the U.S. Army Airborne School and earning prestigious awards like the RECONDO badge and the Superintendent's Award for Excellence. She also began a romantic relationship with Sophie Moore, a fellow cadet. Shortly after Ring Weekend of Kate's final year at the Academy, she was anonymously accused of homosexual conduct. Though given the chance to stay at the Academy and accept a demotion, Kate instead chose to come out as a lesbian in order to prevent a further investigation, thus protecting Sophie and other closeted cadets. Kate resigned from the Academy and was subsequently expelled under Don't-Ask-Don't-Tell.",
    "link" : "https://www.dccomics.com/characters/batwoman",
    "image" : "batwoman",
    "gallery" : [
      "batwoman-1",
      "batwoman-2",
      "batwoman-3",
      "batwoman-4"
    ]
  }
]